Revit 2027 API
ExternalServices.BuiltInExternalServices.TemporaryGraphicsHandlerService Property
 The external service Id which permits registration of an callback handler for temporary graphics objects managed by [!:Autodesk::Revit::DB::TemporaryGraphicsManager]. To use this service, developers implement a server class that derives from [!:Autodesk::Revit::UI::ITemporaryGraphicsHandler].
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId TemporaryGraphicsHandlerService { get; }
Public Shared ReadOnly Property TemporaryGraphicsHandlerService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ TemporaryGraphicsHandlerService {
	ExternalServiceId^ get ();
}
static member TemporaryGraphicsHandlerService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace